tutorials/surfaceTracking/bubbleInterTrackFoam/bubble2D_r0.75mm/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains   4;

method               simple;
//method               hierarchical;
//method               metis;
//method               manual;

simpleCoeffs
{
    n                    (2 2 1);
    delta                0.001;
}

hierarchicalCoeffs
{
    n                    (2 2 1);
    delta                0.001;
    order                xyz;
}

manualCoeffs
{
    dataFile             "decompositionData";
}


// ************************************************************************* //
